In [60]:
import pandas as pd
import numpy as np

In [2]:
df_chamber = pd.read_csv("./data/Chamber/clean_deputies.xz",compression='xz',low_memory=False)

**Pegando soma, média e máximo por ano:**

In [3]:
df_chamber.groupby("year")['document_value'].agg(['sum', 'mean', 'max'])

               sum        mean       max
year
2009  9.280041e+07  539.719295  122850.0
2010  1.227308e+08  600.741115  141000.0
2011  1.270438e+08  595.390144  197000.0
2012  1.254368e+08  636.673372  215000.0
2013  1.322538e+08  681.169332  197370.0
2014  1.425243e+08  827.936564  208320.0
2015  1.581929e+08  757.886380  189600.0
2016  1.671565e+08  831.533252  184500.0
2017  1.238131e+08  820.182399   79900.0

**Vamos também descobrir soma, média e máximo totais:**

In [4]:
df_chamber['document_value'].agg(['sum', 'mean', 'max'])

sum     1.191952e+09
mean    6.955638e+02
max     2.150000e+05
Name: document_value, dtype: float64

**Agora vamos descobrir quem são os responsáveis pelo maior gasto em cada ano:**

In [5]:
df_cp_year = df_chamber.groupby(["congressperson_name", "year"])['document_value'].agg(['sum', 'mean', 'max']).reset_index()

In [6]:
sum_years = df_cp_year.groupby("year")['sum'].max()

In [7]:
sum_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['sum'] == sum_years[2009])]
sum_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['sum'] == sum_years[2010])]
sum_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['sum'] == sum_years[2011])]
sum_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['sum'] == sum_years[2012])]
sum_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['sum'] == sum_years[2013])]
sum_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['sum'] == sum_years[2014])]
sum_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['sum'] == sum_years[2015])]
sum_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['sum'] == sum_years[2016])]
sum_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['sum'] == sum_years[2017])]

In [8]:
sum_2009

     congressperson_name  year        sum          mean      max
5245  WELLINGTON ROBERTO  2009  344510.25  13250.394231  71400.0

In [9]:
sum_2010

     congressperson_name  year        sum         mean      max
4967        URZENI ROCHA  2010  383158.94  3115.113333  23000.0

In [10]:
sum_2011

     congressperson_name  year        sum          mean      max
5247  WELLINGTON ROBERTO  2011  400055.78  12905.025161  84500.0

In [11]:
sum_2012

     congressperson_name  year        sum         mean      max
5401      ÂNGELO AGNOLIN  2012  394079.57  3311.593025  50000.0

In [12]:
sum_2013

     congressperson_name  year        sum         mean      max
4291           RAUL LIMA  2013  418348.99  6536.702969  23500.0

In [13]:
sum_2014

     congressperson_name  year       sum          mean      max
4292           RAUL LIMA  2014  485568.1  17341.717857  55000.0

In [14]:
sum_2015

     congressperson_name  year        sum        mean      max
3398      MARCOS ROGÉRIO  2015  518064.65  841.014042  26770.0

In [15]:
sum_2016

     congressperson_name  year        sum         mean      max
1518     ELIZEU DIONIZIO  2016  505356.39  2168.911545  10000.0

In [16]:
sum_2017

     congressperson_name  year        sum        mean      max
3400      MARCOS ROGÉRIO  2017  402849.36  1224.46614  30000.0

**Vamos descobrir agora quem são os reponsáveis pelos maiores gastos na média em cada ano:**

In [17]:
mean_max_year = df_cp_year.groupby("year")['mean'].max()

In [18]:
mean_max_year

year
2009     17700.000000
2010     33184.323333
2011     28952.000000
2012     20161.111111
2013     47200.000000
2014     62325.000000
2015    109810.000000
2016     19044.845385
2017     18960.417647
Name: mean, dtype: float64

In [19]:
mean_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['mean'] == mean_max_year[2009])]
mean_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['mean'] == mean_max_year[2010])]
mean_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['mean'] == mean_max_year[2011])]
mean_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['mean'] == mean_max_year[2012])]
mean_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['mean'] == mean_max_year[2013])]
mean_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['mean'] == mean_max_year[2014])]
mean_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['mean'] == mean_max_year[2015])]
mean_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['mean'] == mean_max_year[2016])]
mean_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['mean'] == mean_max_year[2017])]

In [20]:
mean_2009

   congressperson_name  year      sum     mean      max
54         ADÃO PRETTO  2009  17700.0  17700.0  17700.0

In [21]:
mean_2010

     congressperson_name  year        sum          mean      max
4771        SILAS CÂMARA  2010  298658.91  33184.323333  93000.0

In [22]:
mean_2011

      congressperson_name  year      sum     mean      max
1676  FERNANDO DE FABINHO  2011  28952.0  28952.0  28952.0

In [23]:
mean_2012

     congressperson_name  year       sum          mean      max
5248  WELLINGTON ROBERTO  2012  362900.0  20161.111111  80000.0

In [24]:
mean_2013

        congressperson_name  year       sum     mean      max
4658  SABINO CASTELO BRANCO  2013  330400.0  47200.0  80000.0

In [25]:
mean_2014

        congressperson_name  year       sum     mean       max
4659  SABINO CASTELO BRANCO  2014  373950.0  62325.0  184500.0

In [26]:
mean_2015

     congressperson_name  year       sum      mean       max
472  ARNALDO FARIA DE SÁ  2015  219620.0  109810.0  189600.0

In [27]:
mean_2016

     congressperson_name  year        sum          mean      max
5297      WLADIMIR COSTA  2016  247582.99  19044.845385  72200.0

In [28]:
mean_2017

     congressperson_name  year       sum          mean      max
4778        SILAS CÂMARA  2017  322327.1  18960.417647  37578.6

**Agora vejamos quem são deputados com menores gastos médios:**

In [29]:
mean_min_year = df_cp_year.groupby("year")['mean'].min()

In [30]:
mean_2009 = df_cp_year[(df_cp_year['year'] == 2009) & (df_cp_year['mean'] == mean_min_year[2009])]
mean_2010 = df_cp_year[(df_cp_year['year'] == 2010) & (df_cp_year['mean'] == mean_min_year[2010])]
mean_2011 = df_cp_year[(df_cp_year['year'] == 2011) & (df_cp_year['mean'] == mean_min_year[2011])]
mean_2012 = df_cp_year[(df_cp_year['year'] == 2012) & (df_cp_year['mean'] == mean_min_year[2012])]
mean_2013 = df_cp_year[(df_cp_year['year'] == 2013) & (df_cp_year['mean'] == mean_min_year[2013])]
mean_2014 = df_cp_year[(df_cp_year['year'] == 2014) & (df_cp_year['mean'] == mean_min_year[2014])]
mean_2015 = df_cp_year[(df_cp_year['year'] == 2015) & (df_cp_year['mean'] == mean_min_year[2015])]
mean_2016 = df_cp_year[(df_cp_year['year'] == 2016) & (df_cp_year['mean'] == mean_min_year[2016])]
mean_2017 = df_cp_year[(df_cp_year['year'] == 2017) & (df_cp_year['mean'] == mean_min_year[2017])]

In [31]:
mean_2009

     congressperson_name  year      sum       mean    max
4475           RODOVALHO  2009  7545.21  40.565645  160.0

In [32]:
mean_2010

      congressperson_name  year        sum       mean     max
2386  JORGE TADEU MUDALEN  2010  128170.67  78.152848  4900.0

In [33]:
mean_2011

    congressperson_name  year      sum      mean     max
910    CELSO RUSSOMANNO  2011  2672.02  65.17122  295.84

In [34]:
mean_2012

     congressperson_name  year    sum   mean    max
2148      HUMBERTO SOUTO  2012  250.2  62.55  103.4

In [35]:
mean_2013

     congressperson_name  year       sum       mean      max
3240    MANUEL ROSA NECA  2013  23099.08  86.838647  1545.07

In [36]:
mean_2014

      congressperson_name  year        sum       mean     max
2390  JORGE TADEU MUDALEN  2014  142048.45  86.142177  3000.0

In [37]:
mean_2015

     congressperson_name  year    sum       mean   max
3170        LÉO OLIVEIRA  2015  115.0  38.333333  50.0

In [38]:
mean_2016

     congressperson_name  year      sum       mean     max
3774    NILMÁRIO MIRANDA  2016  1370.71  91.380667  787.35

In [39]:
mean_2017

      congressperson_name  year        sum       mean      max
2393  JORGE TADEU MUDALEN  2017  144055.37  98.871222  16000.0

**Agora analizemos por partido**

In [125]:
df_party_year = df_chamber.groupby(["party", "year"])['document_value'].agg(['sum', 'mean', 'max', 'count']).reset_index()
# Comment lines bellow if dont want to consider number of politicians in each party
df_party_year['sum'] = df_party_year['sum']/df_party_year["count"]
df_party_year['mean'] = df_party_year['mean']/df_party_year["count"]
df_party_year
# politicians_by_party

       party  year          sum       mean        max  count
0     AVANTE  2009  4493.804697  68.087950   74000.00     66
1     AVANTE  2010  3118.504452  21.359620   35000.00    146
2     AVANTE  2011  1157.309400   1.389327   25000.00    833
3     AVANTE  2012  1231.678729   1.701214   37380.00    724
4     AVANTE  2013  1740.457642   3.283882   35000.00    530
5     AVANTE  2014  2297.015526   5.037315   58500.00    456
6     AVANTE  2015  1392.365636   1.321030   29780.00   1054
7     AVANTE  2016  1024.295658   0.720827   49500.00   1421
8     AVANTE  2017  1042.510652   0.882736   40000.00   1181
9        DEM  2009   624.045365   0.054924   80000.00  11362
10       DEM  2010   678.977617   0.045238  120175.00  15009
11       DEM  2011   572.572505   0.041374   61873.00  13839
12       DEM  2012   647.381914   0.051799   74005.00  12498
13       DEM  2013   739.365229   0.068422   90000.00  10806
14       DEM  2014   840.747149   0.080354  136000.00  10463
15       DEM  2015   827.791386   0.073464   53000.00  11268
16       DEM  2016   928.221988   0.092943   85950.00   9987
17       DEM  2017   901.428043   0.114802   45000.00   7852
18     PCdoB  2009   598.986723   0.166756   40000.00   3592
19     PCdoB  2010   720.569366   0.184951   78620.00   3896
20     PCdoB  2011   600.152995   0.103492   24811.70   5799
21     PCdoB  2012   590.771582   0.115408   25000.00   5119
22     PCdoB  2013   591.345000   0.106818   45000.00   5536
23     PCdoB  2014   717.639348   0.128563  120000.00   5582
24     PCdoB  2015   789.306860   0.164989   31500.00   4784
25     PCdoB  2016   843.915408   0.188753   50000.00   4471
26     PCdoB  2017  1082.332575   0.364790   35000.00   2967
27       PDT  2009   645.826880   0.114875   50000.00   5622
28       PDT  2010   716.010927   0.104558   59979.50   6848
29       PDT  2011   882.576072   0.159974   41750.00   5517
..       ...   ...          ...        ...        ...    ...
215       PV  2010   402.043160   0.060213   36332.00   6677
216       PV  2011   426.823020   0.084402   30747.00   5057
217       PV  2012   445.411529   0.102417   27000.00   4349
218       PV  2013   577.525452   0.137082   38595.00   4213
219       PV  2014   697.669843   0.202340   27219.20   3448
220       PV  2015   477.176544   0.124557   28500.00   3831
221       PV  2016   504.432595   0.137635   51840.00   3665
222       PV  2017   550.323542   0.223527   15000.00   2462
223     REDE  2011   460.366019   1.466134    7560.00    314
224     REDE  2012   323.778387   0.492813    9260.00    657
225     REDE  2013   274.798250   0.372861    6787.26    737
226     REDE  2014   401.817993   0.746874   10500.00    538
227     REDE  2015   444.877497   0.287760   47600.00   1546
228     REDE  2016   607.678088   0.428848   28530.00   1417
229     REDE  2017   594.556453   0.544965   19760.00   1091
230  S.PART.  2009   380.505697   0.411358    6970.00    925
231  S.PART.  2010   357.839718   0.305324   21000.00   1172
232  S.PART.  2011   369.776803   0.352840   16000.00   1048
233  S.PART.  2012   379.780037   0.350028   11250.00   1085
234  S.PART.  2013   360.817000   0.445453   14880.00    810
235  S.PART.  2014   908.444096   4.832149   71340.00    188
236       SD  2009   498.039822   0.233056   15294.00   2137
237       SD  2010   653.089017   0.260922   37250.00   2503
238       SD  2011   724.284734   0.115497   44950.00   6271
239       SD  2012   785.399564   0.125403   42800.00   6263
240       SD  2013   822.776797   0.147056   56000.00   5595
241       SD  2014  1048.658232   0.203347  130000.00   5157
242       SD  2015   915.201631   0.189718  100000.00   4824
243       SD  2016   840.794954   0.151741   72200.00   5541
244       SD  2017   843.503399   0.210036   72000.00   4016

[245 rows x 6 columns]

**Vejamos qual partido teve maior gasto em cada ano:**

In [127]:
sum_years = df_party_year.groupby("year")['sum'].max()
sum_years

year
2009     4493.804697
2010     3991.831360
2011     1252.207408
2012     1432.056090
2013     1740.457642
2014     2297.015526
2015    12028.166667
2016     8699.544643
2017     9742.458125
Name: sum, dtype: float64

In [128]:
sum_party_2009 = df_party_year[(df_party_year['year'] == 2009) & (df_party_year['sum'] == sum_years[2009])]
sum_party_2010 = df_party_year[(df_party_year['year'] == 2010) & (df_party_year['sum'] == sum_years[2010])]
sum_party_2011 = df_party_year[(df_party_year['year'] == 2011) & (df_party_year['sum'] == sum_years[2011])]
sum_party_2012 = df_party_year[(df_party_year['year'] == 2012) & (df_party_year['sum'] == sum_years[2012])]
sum_party_2013 = df_party_year[(df_party_year['year'] == 2013) & (df_party_year['sum'] == sum_years[2013])]
sum_party_2014 = df_party_year[(df_party_year['year'] == 2014) & (df_party_year['sum'] == sum_years[2014])]
sum_party_2015 = df_party_year[(df_party_year['year'] == 2015) & (df_party_year['sum'] == sum_years[2015])]
sum_party_2016 = df_party_year[(df_party_year['year'] == 2016) & (df_party_year['sum'] == sum_years[2016])]
sum_party_2017 = df_party_year[(df_party_year['year'] == 2017) & (df_party_year['sum'] == sum_years[2017])]

In [129]:
sum_party_2009

    party  year          sum      mean      max  count
0  AVANTE  2009  4493.804697  68.08795  74000.0     66

In [130]:
sum_party_2010

    party  year         sum       mean      max  count
116  PROS  2010  3991.83136  12.059913  48000.0    331

In [131]:
sum_party_2011

    party  year          sum      mean      max  count
117  PROS  2011  1252.207408  0.543729  44500.0   2303

In [132]:
sum_party_2012

    party  year         sum      mean      max  count
118  PROS  2012  1432.05609  0.703367  50000.0   2036

In [133]:
sum_party_2013

    party  year          sum      mean      max  count
4  AVANTE  2013  1740.457642  3.283882  35000.0    530

In [134]:
sum_party_2014

    party  year          sum      mean      max  count
5  AVANTE  2014  2297.015526  5.037315  58500.0    456

In [135]:
sum_party_2015

    party  year           sum         mean      max  count
128   PRP  2015  12028.166667  2004.694444  32790.0      6

In [136]:
sum_party_2016

    party  year          sum        mean      max  count
129   PRP  2016  8699.544643  310.698023  28500.0     28

In [137]:
sum_party_2017

    party  year          sum        mean      max  count
130   PRP  2017  9742.458125  304.451816  38000.0     32

**Vamos descobrir agora quem são os partidos reponsáveis pelos maiores gastos na média em cada ano:**

In [138]:
mean_max_year = df_party_year.groupby("year")['mean'].max()

In [139]:
mean_max_year

year
2009      68.087950
2010      21.359620
2011       2.109643
2012       3.706317
2013       3.283882
2014       9.858150
2015    2004.694444
2016     310.698023
2017     304.451816
Name: mean, dtype: float64

In [140]:
mean_2009 = df_party_year[(df_party_year['year'] == 2009) & (df_party_year['mean'] == mean_max_year[2009])]
mean_2010 = df_party_year[(df_party_year['year'] == 2010) & (df_party_year['mean'] == mean_max_year[2010])]
mean_2011 = df_party_year[(df_party_year['year'] == 2011) & (df_party_year['mean'] == mean_max_year[2011])]
mean_2012 = df_party_year[(df_party_year['year'] == 2012) & (df_party_year['mean'] == mean_max_year[2012])]
mean_2013 = df_party_year[(df_party_year['year'] == 2013) & (df_party_year['mean'] == mean_max_year[2013])]
mean_2014 = df_party_year[(df_party_year['year'] == 2014) & (df_party_year['mean'] == mean_max_year[2014])]
mean_2015 = df_party_year[(df_party_year['year'] == 2015) & (df_party_year['mean'] == mean_max_year[2015])]
mean_2016 = df_party_year[(df_party_year['year'] == 2016) & (df_party_year['mean'] == mean_max_year[2016])]
mean_2017 = df_party_year[(df_party_year['year'] == 2017) & (df_party_year['mean'] == mean_max_year[2017])]

In [141]:
mean_2009

    party  year          sum      mean      max  count
0  AVANTE  2009  4493.804697  68.08795  74000.0     66

In [142]:
mean_2010

    party  year          sum      mean      max  count
1  AVANTE  2010  3118.504452  21.35962  35000.0    146

In [143]:
mean_2011

   party  year          sum      mean      max  count
72  PODE  2011  1080.137285  2.109643  18500.0    512

In [144]:
mean_2012

     party  year         sum      mean      max  count
210  PTdoB  2012  852.452913  3.706317  31200.0    230

In [145]:
mean_2013

    party  year          sum      mean      max  count
4  AVANTE  2013  1740.457642  3.283882  35000.0    530

In [146]:
mean_2014

    party  year         sum     mean      max  count
168  PSDC  2014  966.098673  9.85815  20000.0     98

In [147]:
mean_2015

    party  year           sum         mean      max  count
128   PRP  2015  12028.166667  2004.694444  32790.0      6

In [148]:
mean_2016

    party  year          sum        mean      max  count
129   PRP  2016  8699.544643  310.698023  28500.0     28

In [149]:
mean_2017

    party  year          sum        mean      max  count
130   PRP  2017  9742.458125  304.451816  38000.0     32

**Agora vejamos quem são os partidos com menores gastos médios:**

In [150]:
mean_min_year = df_party_year.groupby("year")['mean'].min()

In [151]:
mean_2009 = df_party_year[(df_party_year['year'] == 2009) & (df_party_year['mean'] == mean_min_year[2009])]
mean_2010 = df_party_year[(df_party_year['year'] == 2010) & (df_party_year['mean'] == mean_min_year[2010])]
mean_2011 = df_party_year[(df_party_year['year'] == 2011) & (df_party_year['mean'] == mean_min_year[2011])]
mean_2012 = df_party_year[(df_party_year['year'] == 2012) & (df_party_year['mean'] == mean_min_year[2012])]
mean_2013 = df_party_year[(df_party_year['year'] == 2013) & (df_party_year['mean'] == mean_min_year[2013])]
mean_2014 = df_party_year[(df_party_year['year'] == 2014) & (df_party_year['mean'] == mean_min_year[2014])]
mean_2015 = df_party_year[(df_party_year['year'] == 2015) & (df_party_year['mean'] == mean_min_year[2015])]
mean_2016 = df_party_year[(df_party_year['year'] == 2016) & (df_party_year['mean'] == mean_min_year[2016])]
mean_2017 = df_party_year[(df_party_year['year'] == 2017) & (df_party_year['mean'] == mean_min_year[2017])]

In [152]:
mean_2009

    party  year         sum      mean      max  count
187    PT  2009  452.383491  0.015033  93000.0  30092

In [153]:
mean_2010

    party  year         sum     mean       max  count
188    PT  2010  527.985196  0.01597  120000.0  33062

In [154]:
mean_2011

    party  year         sum     mean       max  count
189    PT  2011  501.216393  0.01322  194100.0  37914

In [155]:
mean_2012

    party  year        sum      mean       max  count
190    PT  2012  520.13831  0.014146  162580.0  36770

In [156]:
mean_2013

    party  year         sum      mean      max  count
191    PT  2013  553.594146  0.014933  89940.0  37071

In [157]:
mean_2014

    party  year         sum      mean      max  count
192    PT  2014  673.273295  0.019869  96890.0  33886

In [158]:
mean_2015

    party  year         sum      mean       max  count
193    PT  2015  584.039878  0.019268  137900.0  30311

In [159]:
mean_2016

    party  year         sum     mean      max  count
194    PT  2016  615.091908  0.02011  87000.0  30587

In [160]:
mean_2017

    party  year         sum      mean      max  count
195    PT  2017  574.875582  0.023031  45000.0  24961